# EnableLBExternalSort

## Description
Enables/disables external sorting.

```pascal
PROCEDURE EnableLBExternalSort(
				dialogID    : LONGINT;
				componentID : LONGINT;
				enable      : BOOLEAN);
```

```python

def vs.EnableLBExternalSort(dialogID, componentID, enable):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT|id of the dialog that contains the list browser|
|componentID|LONGINT|id of the list browser control|
|enable|BOOLEAN|specifies whether to enable or disable external sorting|

## Version
Availability: from Vectorworks 2020
## Category
* Dialogs - Modern - Browser